-- 设置编码为utf-8
SET NAMES UTF8;
-- 如果存在,就丢弃
DROP DATABASE IF EXISTS pc;
-- 创建数据库
CREATE DATABASE pc CHARSET=UTF8;
-- 进入数据库
USE pc;
-- 创建数据库表
CREATE TABLE login(
    id INT PRIMARY KEY AUTO_INCREMENT,
    uname VARCHAR(50),
    upwd VARCHAR(32)
);
-- 添加账号密码
INSERT INTO login VALUES(null,'panbaohua','123456');
INSERT INTO login VALUES(null,'123456','123456');


-- 首页数据
DROP TABLE IF EXISTS `index_detail`;
CREATE TABLE `index_detail`(
    `id` int(11) PRIMARY KEY,
    `img` varchar(255) NOT NULL,
    `title` varchar(255) NOT NULL,
    `title1` varchar(255) NOT NULL,
    `img1` varchar(255) NOT NULL
)ENGINE=InnoDB DEFAULT CHARSET=utf8;
INSERT INTO `index_detail` (`id`,`img`,`title`,`title1`,`img1`)VALUES(
    "1","01.jpg","草莓童话","298/2.0磅","shop.jpg"),
("2","02.jpg","520数字蛋糕","297/标准规格","shop.jpg"),
("3","03.jpg","100数字蛋糕","297/标准规格","shop.jpg"),
("4","04.jpg","blue蓝.童心未泯","298/2.0磅","shop.jpg"),
("5","05.jpg","美少女|香蕉巧克力慕斯","298/2.0磅","shop.jpg"),
("6","06.jpg","芒果淡奶","268/2.0磅","shop.jpg"),
("7","07.jpg","草莓淡奶","268/2.0磅","shop.jpg"),
("8","23.jpg","pink粉·童心未泯","298/2.0磅","shop.jpg");

-- 获取首页详情数据
DROP TABLE IF EXISTS `index_xiangqing`;
CREATE TABLE `index_xiangqing`(
    `id` int(11) PRIMARY KEY,
    `img` varchar(255) NOT NULL,
    `title` varchar(255) NOT NULL,
    `title1` varchar(255) NOT NULL,
    `price` decimal(10,2) NOT NULL,
    `title3` varchar(255) NOT NULL,
    `title4` varchar(255) NOT NULL,
    `title5` varchar(255) NOT NULL,
    `title6` varchar(255) NOT NULL,
    `img1` varchar(255) NOT NULL,
    `img2` varchar(255) NOT NULL,
    `img3` varchar(255) NOT NULL,
    `img4` varchar(255) NOT NULL,
    `img5` varchar(255) NOT NULL
)ENGINE=InnoDB DEFAULT CHARSET=utf8;
INSERT INTO `index_xiangqing` (`id`,`img`,`title`,`title1`,`price`,
    `title3`, `title4`,`title5`,`title6`,`img1`,`img2`,`img3`,`img4`,`img5`
)VALUES("1","01.jpg","草莓童话","圣诞节遇上草莓季，雪白的 cream cheese 包裹粉色的草莓奶油，坚果香浓郁的开心果酱与新鲜的红颜草莓果肉，完美的诠释了圣诞的色彩，美味交叠在口中绽放。圣诞童话，你の圣诞礼物，请查收","298","1.0磅","2.0磅","3.0磅","5.0磅","01.jpg","11.jpg","12.jpg","13.jpg","10.jpg"),
("2","02.jpg","520数字蛋糕","让数字告白蛋糕替你说 “ 我爱你！”","297","标准规格","","","","02.jpg","15.jpg","12.jpg","13.jpg","16.jpg"),
("3","03.jpg","100数字蛋糕","宝宝百天蛋糕 | 满分蛋糕","297","标准规格","","","","03.jpg","18.jpg","12.jpg","13.jpg","19.jpg"),
("4","04.jpg","blue蓝·童心未泯","岁月永远年轻，我们慢慢老去，你会发现，童心未泯是一件值得骄傲的事情。琐碎的生活总会带来很多糟心的事情，但是只要我们保持一颗童心，不忘初心，就能看到生活的美好","298","1.0磅","2.0磅","3.0磅","5.0磅","04.jpg","21.jpg","12.jpg","13.jpg","22.jpg"),
("5","25.jpg","美少女 | 香蕉巧克力慕斯","法国香蕉果茸马与法芙娜牛奶巧克力完美配比,俏皮的玩偶点缀可爱的马卡龙配色， 入口的那一秒变身美少女。","298","1.0磅","2.0磅","3.0磅","5.0磅","25.jpg","26.jpg","12.jpg","13.jpg","27.jpg"),
("6","06.jpg","芒果淡奶","明黄色是春夏开启的甜蜜信号 热情馥郁の芒果肉透亮而香甜 与特调乳脂淡奶油极致融合后 淡甜细腻在明媚季节温暖上市","268","1.0磅","2.0磅","3.0磅","5.0磅","06.jpg","28.jpg","12.jpg","13.jpg","29.jpg"),
("7","07.jpg","草莓淡奶","最适合做蛋糕的新鲜红颜草莓， 选用最细腻奶油调配极致柔和， 蛋糕美味哲学草莓的完美演绎。","268","1.0磅","2.0磅","3.0磅","5.0磅","07.jpg","30.jpg","12.jpg","13.jpg","31.jpg"),
("8","23.jpg","pink粉·童心未泯","岁月永远年轻，我们慢慢老去，你会发现，童心未泯是一件值得骄傲的事情。琐碎的生活总会带来很多糟心的事情，但是只要我们保持一颗童心，不忘初心，就能看到生活的美好。","298","1.0磅","2.0磅","3.0磅","5.0磅","23.jpg","23.jpg","12.jpg","13.jpg","24.jpg");

-- 获取蛋糕数据
DROP TABLE IF EXISTS `dangao_detail`;
CREATE TABLE `dangao_detail`(
    `id` int(11) PRIMARY KEY,
    `img` varchar(255) NOT NULL,
    `title` varchar(255) NOT NULL,
    `title1` varchar(255) NOT NULL,
    `title2` varchar(255) NOT NULL,
    `price` decimal(10,2) NOT NULL,
    `btn` varchar(255) NOT NULL
)ENGINE=InnoDB DEFAULT CHARSET=utf8;
INSERT INTO `dangao_detail` (`id`,`img`,`title`,`title1`,`title2`,`price`,`btn`)VALUES
    ("1","01.jpg","草莓童话","口味：草莓开心果","圣诞节遇上草莓季，雪白的 cream cheese 包裹粉色的草莓奶油，坚果香浓郁的开心果酱与新鲜的红颜草莓果肉，完美的诠释了圣诞的色彩，美味交叠在口中绽放。圣诞童话，你の圣诞礼物，请查收!","198","查看详情"),
    ("2","32.jpg","大理石 · 草莓库里","口味：草莓","粉色INS大理石，满足你的少女心 草莓慕斯包裹酸甜可口的草莓库里 充满暧昧，融化在两人小甜蜜里","198","查看详情"),
    ("3","33.jpg","NEW卡布奇诺","口味：牛奶咖啡","爱情像cappuccino 浓浓的眷恋泡沫 意大利语中将卡布奇诺 译成·我爱你 甜中带苦，苦中有甜 情人节的浪漫延续 3.14 白色情人节来自女神的回礼 给你中意的那个他 人一生当中会遇到约 2920 万个人 两个人相爱概率是0. 000049 如果妳认定了那个他请给他爱的回应","198","查看详情"),
    ("4","02.jpg","520数字蛋糕","口味：","让数字告白蛋糕替你说 “ 我爱你！”","297","查看详情"),
    ("5","03.jpg","100数字蛋糕","口味：","宝宝百天蛋糕 | 满分蛋糕","297","查看详情"),
    ("6","34.jpg","	深爱百利甜","口味：","当甜蜜的蛋糕在嘴里化开时，那个与你分享蛋糕的人就是你深爱的人了。","198","查看详情"),
    ("7","04.jpg","blue蓝·童心未泯","口味：牛奶巧克力慕斯或牛奶草莓慕斯","岁月永远年轻，我们慢慢老去，你会发现，童心未泯是一件值得骄傲的事情。琐碎的生活总会带来很多糟心的事情，但是只要我们保持一颗童心，不忘初心，就能看到生活的美好。","198","查看详情"),
    ("8","23.jpg","	pink粉·童心未泯","口味：牛奶巧克力慕斯或牛奶草莓慕斯","岁月永远年轻，我们慢慢老去，你会发现，童心未泯是一件值得骄傲的事情。琐碎的生活总会带来很多糟心的事情，但是只要我们保持一颗童心，不忘初心，就能看到生活的美好。","198","查看详情"),
    ("9","05.jpg","美少女 | 香蕉巧克力慕斯","口味：香蕉巧克力","法国香蕉果茸马与法芙娜牛奶巧克力完美配比， 俏皮的玩偶点缀可爱的马卡龙配色， 入口的那一秒变身美少女。","198","查看详情"),
    ("10","06.jpg","芒果淡奶","口味：芒果口味","明黄色是春夏开启的甜蜜信号 热情馥郁の芒果肉透亮而香甜 与特调乳脂淡奶油极致融合后 淡甜细腻在明媚季节温暖上市","168","查看详情"),
    ("11","35.jpg","草莓淡奶","口味：草莓奶油","最适合做蛋糕的新鲜红颜草莓， 选用最细腻奶油调配极致柔和， 蛋糕美味哲学草莓的完美演绎。","168","查看详情"),
    ("12","08.jpg","爱情の味道","口味：玫瑰／浆果","玫瑰花酿与百利甜酒浪漫碰撞， 饱满果浆似恋爱般酸甜而温婉， 我把对你的爱藏在了这蛋糕里 ， 这一口，你尝到是爱情の味道。","198","查看详情"),
    ("13","36.jpg","酒浸樱桃巧克力","口味：巧克力味","“酒浸樱桃”在甜品界有着举足轻重的分量，由威士忌、白兰地等烈酒用上等樱桃泡制出来的樱桃酱充满浓郁的果香气，酒精度被樱桃中和后入口没有那么浓烈，甜度适中，特别适合与奶油、巧克力、蛋糕相配合，一来是增加了天然的果甜度，二来樱桃酱中的酒液也增加了糕点的湿度以及丰富了口感的层次。","198","查看详情"),
    ("14","37.jpg","百利甜情人","口味：乳脂奶油味","百利甜酒的加入与淡奶油产生奇妙的化学反应，就像爱情的忽然发生。奶油中透着百利甜特有的芳香，混合天然的玫瑰香味，重油坯质感十足…","168","查看详情"),
    ("15","38.jpg","榴芒双拼","口味：榴莲芒果味","榴莲凭着它那独特的香味，滑似奶膏的果肉，令爱吃之人久久不能忘怀。搭配芒果慕斯酸甜清爽。","198","查看详情"),
    ("16","39.jpg","芒果千层","口味：芒果口味","Q软的可丽饼融合细腻的淡奶油 坠入新鲜的澳芒透亮奔放的香","198","查看详情"),
    ("17","40.jpg","芒果慕斯","口味：芒果味","谁是炎炎盛夏里最受爱戴的水果明星，当非芒果莫属！妍媚透亮奔放的香，丰腴得饱满欲滴的甜，新鲜清爽的酸、绵细软糯的口感，让人仿佛置身于阳光、沙滩、椰树、芒果飘香的热带风情里。","229","查看详情"),
    ("18","41.jpg","草莓千层","口味：Q软的可丽饼融合细腻的淡奶油 遇上酸甜适度皮薄汁多的红颜草莓","Q软的可丽饼融合细腻的淡奶油 遇上酸甜适度皮薄汁多的红颜草莓","198","查看详情"),
    ("19","42.jpg","淡奶兰心","口味：椰子／浆果","牛乳椰子芝士威忌廉夹心的清香味挑逗着味蕾， 融入樱桃浆果的奶油戚风蛋糕胚入口悠香绵软， 马卡龙和心形巧克力俏皮的点缀之下清新淡雅。","198","查看详情"),
    ("20","43.jpg","宇治抹茶","口味：宇治抹茶味","宇治伯爵，东西方文化的再次融合，只为帮您诠释“入口即化”的意义。消失于舌尖的瞬间轻盈如丝，只留下茶香余韵，将产至斯里兰卡的伯爵茶与日本宇治抹茶相结合产生的一丝遵从和厚重微妙的平复了味觉的浮躁，岁月如歌，时光滞留。","198","查看详情"),
    ("21","44.jpg","四拼","口味：暗香 花嫁 芒果慕斯 绿茶慕斯","春晨，茶韵滴滴相思； 夏日，鲜芒甜蜜来袭； 秋收，硕果累累喜人； 冬夜，黑巧温暖飘香。","329","查看详情"),
    ("22","45.jpg","金牌提拉米苏","口味：奶酪味","可可的微苦，巧克力的馥郁，咖啡的稠香，把爱意放进她/他的嘴里，无需言语。","168","查看详情"),
    ("23","46.jpg","黑白巧克力慕斯","口味：巧克力","口感冰凉细腻，白巧克力慕斯的甜与底部黑巧克力的苦，配合得如此微妙又如此美味，纯正巧克力的香浓口感，给强烈的色彩反差赋予了韵味","168","查看详情");

-- 获取蛋糕详情数据
DROP TABLE IF EXISTS `dangao_xiangqing`;
CREATE TABLE `dangao_xiangqing`(
    `id` int(11) PRIMARY KEY,
    `img` varchar(255) NOT NULL,
    `title` varchar(255) NOT NULL,
    `title1` varchar(255) NOT NULL,
    `price` decimal(10,2) NOT NULL,
    `title3` varchar(255) NOT NULL,
    `title4` varchar(255) NOT NULL,
    `title5` varchar(255) NOT NULL,
    `title6` varchar(255) NOT NULL,
    `img1` varchar(255) NOT NULL,
    `img2` varchar(255) NOT NULL,
    `img3` varchar(255) NOT NULL,
    `img4` varchar(255) NOT NULL,
    `img5` varchar(255) NOT NULL
)ENGINE=InnoDB DEFAULT CHARSET=utf8;
INSERT INTO `dangao_xiangqing` (`id`,`img`,`title`,`title1`,`price`,
    `title3`, `title4`,`title5`,`title6`,`img1`,`img2`,`img3`,`img4`,`img5`
)VALUES("1","01.jpg","草莓童话","圣诞节遇上草莓季，雪白的 cream cheese 包裹粉色的草莓奶油，坚果香浓郁的开心果酱与新鲜的红颜草莓果肉，完美的诠释了圣诞的色彩，美味交叠在口中绽放。圣诞童话，你の圣诞礼物，请查收","298","1.0磅","2.0磅","3.0磅","5.0磅","01.jpg","11.jpg","12.jpg","13.jpg","10.jpg"),
("2","47.jpg","大理石 · 草莓库里","粉色INS大理石，满足你的少女心 草莓慕斯包裹酸甜可口的草莓库里 充满暧昧，融化在两人小甜蜜里","298","1.0磅","2.0磅","3.0磅","5.0磅","47.jpg","48.jpg","12.jpg","13.jpg","49.jpg"),
("3","33.jpg","NEW卡布奇诺","爱情像cappuccino 浓浓的眷恋泡沫 意大利语中将卡布奇诺 译成·我爱你 甜中带苦，苦中有甜 情人节的浪漫延续 3.14 白色情人节来自女神的回礼 给你中意的那个他 人一生当中会遇到约 2920 万个人 两个人相爱概率是0. 000049 如果妳认定了那个他请给他爱的回应","298","1.0磅","2.0磅","3.0磅","5.0磅","50.jpg","33.jpg","12.jpg","13.jpg","51.jpg"),
("4","02.jpg","520数字蛋糕","让数字告白蛋糕替你说 “ 我爱你！”","297","标准规格","","","","02.jpg","15.jpg","12.jpg","13.jpg","16.jpg"),
("5","03.jpg","100数字蛋糕","宝宝百天蛋糕 | 满分蛋糕","297","标准规格","","","","03.jpg","18.jpg","12.jpg","13.jpg","19.jpg"),
("6","52.jpg","深爱百利甜","当甜蜜的蛋糕在嘴里化开时，那个与你分享蛋糕的人就是你深爱的人了。","298","1.0磅","2.0磅","3.0磅","5.0磅","52.jpg","53.jpg","12.jpg","13.jpg","54.jpg"),
("7","04.jpg","blue蓝·童心未泯","岁月永远年轻，我们慢慢老去，你会发现，童心未泯是一件值得骄傲的事情。琐碎的生活总会带来很多糟心的事情，但是只要我们保持一颗童心，不忘初心，就能看到生活的美好","298","1.0磅","2.0磅","3.0磅","5.0磅","04.jpg","21.jpg","12.jpg","13.jpg","22.jpg"),
("8","23.jpg","pink粉·童心未泯","岁月永远年轻，我们慢慢老去，你会发现，童心未泯是一件值得骄傲的事情。琐碎的生活总会带来很多糟心的事情，但是只要我们保持一颗童心，不忘初心，就能看到生活的美好。","298","1.0磅","2.0磅","3.0磅","5.0磅","23.jpg","23.jpg","12.jpg","13.jpg","24.jpg"),
("9","25.jpg","美少女 | 香蕉巧克力慕斯","法国香蕉果茸马与法芙娜牛奶巧克力完美配比,俏皮的玩偶点缀可爱的马卡龙配色， 入口的那一秒变身美少女。","298","1.0磅","2.0磅","3.0磅","5.0磅","25.jpg","26.jpg","12.jpg","13.jpg","27.jpg"),
("10","06.jpg","芒果淡奶","明黄色是春夏开启的甜蜜信号 热情馥郁の芒果肉透亮而香甜 与特调乳脂淡奶油极致融合后 淡甜细腻在明媚季节温暖上市","268","1.0磅","2.0磅","3.0磅","5.0磅","06.jpg","28.jpg","12.jpg","13.jpg","29.jpg"),
("11","07.jpg","草莓淡奶","最适合做蛋糕的新鲜红颜草莓， 选用最细腻奶油调配极致柔和， 蛋糕美味哲学草莓的完美演绎。","268","1.0磅","2.0磅","3.0磅","5.0磅","07.jpg","30.jpg","12.jpg","13.jpg","31.jpg"),
("12","08.jpg","爱情の味道","玫瑰花酿与百利甜酒浪漫碰撞， 饱满果浆似恋爱般酸甜而温婉， 我把对你的爱藏在了这蛋糕里 ， 这一口，你尝到是爱情の味道。","298","1.0磅","2.0磅","3.0磅","5.0磅","08.jpg","55.jpg","12.jpg","13.jpg","56.jpg"),
("13","36.jpg","酒浸樱桃巧克力","“酒浸樱桃”在甜品界有着举足轻重的分量，由威士忌、白兰地等烈酒用上等樱桃泡制出来的樱桃酱充满浓郁的果香气，酒精度被樱桃中和后入口没有那么浓烈，甜度适中，特别适合与奶油、巧克力、蛋糕相配合，一来是增加了天然的果甜度，二来樱桃酱中的酒液也增加了糕点的湿度以及丰富了口感的层次。","198","6寸","8寸","10寸","14寸","36.jpg","57.jpg","12.jpg","13.jpg","58.jpg"),
("14","59.jpg","百利甜情人","百利甜酒的加入与淡奶油产生奇妙的化学反应，就像爱情的忽然发生。奶油中透着百利甜特有的芳香，混合天然的玫瑰香味，重油坯质感十足…","268","1.0磅","2.0磅","3.0磅","5.0磅","59.jpg","60.jpg","12.jpg","13.jpg","61.jpg"),
("15","38.jpg","榴芒双拼","榴莲凭着它那独特的香味，滑似奶膏的果肉，令爱吃之人久久不能忘怀。搭配芒果慕斯酸甜清爽。","298","1.0磅","2.0磅","3.0磅","5.0磅","38.jpg","62.jpg","12.jpg","13.jpg","63.jpg"),
("16","39.jpg","芒果千层","Q软的可丽饼融合细腻的淡奶油 坠入新鲜的澳芒透亮奔放的香","198","6寸","8寸","10寸","14寸","39.jpg","64.jpg","12.jpg","13.jpg","65.jpg"),
("17","66.jpg","芒果慕斯","谁是炎炎盛夏里最受爱戴的水果明星，当非芒果莫属！妍媚透亮奔放的香，丰腴得饱满欲滴的甜，新鲜清爽的酸、绵细软糯的口感，让人仿佛置身于阳光、沙滩、椰树、芒果飘香的热带风情里。","329","1.0磅","2.0磅","3.0磅","5.0磅","66.jpg","67.jpg","12.jpg","13.jpg","68.jpg"),
("18","41.jpg","草莓千层","Q软的可丽饼融合细腻的淡奶油 遇上酸甜适度皮薄汁多的红颜草莓","198","6寸","8寸","10寸","14寸","41.jpg","69.jpg","12.jpg","13.jpg","70.jpg"),
("19","71.jpg","淡奶兰心","牛乳椰子芝士威忌廉夹心的清香味挑逗着味蕾， 融入樱桃浆果的奶油戚风蛋糕胚入口悠香绵软， 马卡龙和心形巧克力俏皮的点缀之下清新淡雅。","198","1.0磅","2.0磅","3.0磅","5.0磅","71.jpg","72.jpg","12.jpg","13.jpg","73.jpg"),
("20","43.jpg","宇治抹茶","宇治伯爵，东西方文化的再次融合，只为帮您诠释“入口即化”的意义。消失于舌尖的瞬间轻盈如丝，只留下茶香余韵，将产至斯里兰卡的伯爵茶与日本宇治抹茶相结合产生的一丝遵从和厚重微妙的平复了味觉的浮躁，岁月如歌，时光滞留。","298","1.0磅","2.0磅","3.0磅","5.0磅","43.jpg","74.jpg","12.jpg","13.jpg","75.jpg"),
("21","44.jpg","四拼","春晨，茶韵滴滴相思； 夏日，鲜芒甜蜜来袭； 秋收，硕果累累喜人； 冬夜，黑巧温暖飘香。","329","1.0磅","2.0磅","3.0磅","5.0磅","44.jpg","76.jpg","12.jpg","13.jpg","77.jpg"),
("22","78.jpg","金牌提拉米苏","可可的微苦，巧克力的馥郁，咖啡的稠香，把爱意放进她/他的嘴里，无需言语。","268","1.0磅","2.0磅","3.0磅","5.0磅","78.jpg","79.jpg","12.jpg","13.jpg","80.jpg"),
("23","46.jpg","黑白巧克力慕斯","口感冰凉细腻，白巧克力慕斯的甜与底部黑巧克力的苦，配合得如此微妙又如此美味，纯正巧克力的香浓口感，给强烈的色彩反差赋予了韵味","268","1.0磅","2.0磅","3.0磅","5.0磅","46.jpg","81.jpg","12.jpg","13.jpg","82.jpg");

-- 获取精品推荐数据
DROP TABLE IF EXISTS `jingpin_detail`;
CREATE TABLE `jingpin_detail`(
    `id` int(11) PRIMARY KEY,
    `img` varchar(255) NOT NULL,
    `title` varchar(255) NOT NULL,
    `title1` varchar(255) NOT NULL,
    `title2` varchar(255) NOT NULL,
    `price` decimal(10,2) NOT NULL,
    `btn` varchar(255) NOT NULL,
    `btn1` varchar(255) NOT NULL
)ENGINE=InnoDB DEFAULT CHARSET=utf8;
INSERT INTO `jingpin_detail` (`id`,`img`,`title`,`title1`,`title2`,`price`,`btn`,`btn1`)VALUES
    ("1","01.jpg","草莓童话","口味：草莓开心果","圣诞节遇上草莓季，雪白的 cream cheese 包裹粉色的草莓奶油，坚果香浓郁的开心果酱与新鲜的红颜草莓果肉，完美的诠释了圣诞的色彩，美味交叠在口中绽放。圣诞童话，你の圣诞礼物，请查收!","198","查看详情","加入购物车"),
    ("2","02.jpg","520数字蛋糕","口味：","让数字告白蛋糕替你说 “ 我爱你！”","297","查看详情","加入购物车"),
    ("3","03.jpg","100数字蛋糕","口味：","宝宝百天蛋糕 | 满分蛋糕","297","查看详情","加入购物车"),
    ("4","04.jpg","blue蓝·童心未泯","口味：牛奶巧克力慕斯或牛奶草莓慕斯","岁月永远年轻，我们慢慢老去，你会发现，童心未泯是一件值得骄傲的事情。琐碎的生活总会带来很多糟心的事情，但是只要我们保持一颗童心，不忘初心，就能看到生活的美好。","198","查看详情","加入购物车"),
    ("5","23.jpg","	pink粉·童心未泯","口味：牛奶巧克力慕斯或牛奶草莓慕斯","岁月永远年轻，我们慢慢老去，你会发现，童心未泯是一件值得骄傲的事情。琐碎的生活总会带来很多糟心的事情，但是只要我们保持一颗童心，不忘初心，就能看到生活的美好。","198","查看详情","加入购物车"),
    ("6","05.jpg","美少女 | 香蕉巧克力慕斯","口味：香蕉巧克力","法国香蕉果茸马与法芙娜牛奶巧克力完美配比， 俏皮的玩偶点缀可爱的马卡龙配色， 入口的那一秒变身美少女。","198","查看详情","加入购物车"),
    ("7","06.jpg","芒果淡奶","口味：芒果口味","明黄色是春夏开启的甜蜜信号 热情馥郁の芒果肉透亮而香甜 与特调乳脂淡奶油极致融合后 淡甜细腻在明媚季节温暖上市","168","查看详情","加入购物车"),
    ("8","08.jpg","爱情の味道","口味：玫瑰／浆果","玫瑰花酿与百利甜酒浪漫碰撞， 饱满果浆似恋爱般酸甜而温婉， 我把对你的爱藏在了这蛋糕里 ， 这一口，你尝到是爱情の味道。","198","查看详情","加入购物车"),
    ("9","39.jpg","芒果千层","口味：芒果口味","Q软的可丽饼融合细腻的淡奶油 坠入新鲜的澳芒透亮奔放的香","198","查看详情","加入购物车"),
    ("10","41.jpg","草莓千层","口味：Q软的可丽饼融合细腻的淡奶油 遇上酸甜适度皮薄汁多的红颜草莓","Q软的可丽饼融合细腻的淡奶油 遇上酸甜适度皮薄汁多的红颜草莓","198","查看详情","加入购物车"),
    ("11","83.jpg","原味 · 北海道の轻芝士","口味：牛乳轻芝士","传说中最柔软的蛋糕，就像爱情温软而绵密。原味：顶级乳酪遇上北海道原生态尊贵牛乳","198","查看详情","加入购物车"),
    ("12","84.jpg","榴莲芝士","口味：榴莲味","一袭素雅净白里等待着你的是怎样难以抵挡的诱惑—浓郁的芝士味混合着迷人的榴莲香，口腔里还有依稀回荡的白兰地，仿佛踏上繁华热闹的异域之旅...","198","查看详情","加入购物车"),
    ("13","85.jpg","奶油小贝BOX下午茶（整盒芒果）","口味：芒果（一套21小个）","This Box ，一口治愈假期综合症。","199","查看详情","加入购物车"),
    ("14","86.jpg","Mini切片组合（白桃 | 蓝莓 | 金牌 | 百利甜 | 芒慕 | 覆盆子）","口味：（白桃 | 蓝莓 | 金牌 | 百利甜 | 芒慕 | 覆盆子）","分享有多重要，蛋糕就有多美味。每份约200克","266","查看详情","加入购物车"),
    ("15","87.jpg","new-奶油小贝BOX下午茶（三拼）","口味：草莓、抹茶、芒果（一套21小个，三种口味各七个）","This Box ，一口治愈假期综合症。","199","查看详情","加入购物车"),
    ("16","88.jpg","芒果酸奶双拼","口味：芒果拼酸奶","鲜奶包裹着的浓郁芒果肉透亮而香甜，搭配酸奶慕斯淡淡的奶香清新的口感，正是夏天的味道。","298","查看详情","加入购物车"),
    ("17","89.jpg","朗姆芝士","口味：芝士味","奶油中淡淡的朗姆酒香，微微的苦涩，混合蛋糕坯中香橙的清香，夹心中奶酪天然的奶香和自然的酸味…","168","查看详情","加入购物车");

-- 获取精品推荐详情数据
DROP TABLE IF EXISTS `jingpin_xiangqing`;
CREATE TABLE `jingpin_xiangqing`(
    `id` int(11) PRIMARY KEY,
    `img` varchar(255) NOT NULL,
    `title` varchar(255) NOT NULL,
    `title1` varchar(255) NOT NULL,
    `price` decimal(10,2) NOT NULL,
    `title3` varchar(255) NOT NULL,
    `title4` varchar(255) NOT NULL,
    `title5` varchar(255) NOT NULL,
    `title6` varchar(255) NOT NULL,
    `img1` varchar(255) NOT NULL,
    `img2` varchar(255) NOT NULL,
    `img3` varchar(255) NOT NULL,
    `img4` varchar(255) NOT NULL,
    `img5` varchar(255) NOT NULL
)ENGINE=InnoDB DEFAULT CHARSET=utf8;
INSERT INTO `jingpin_xiangqing` (`id`,`img`,`title`,`title1`,`price`,
    `title3`, `title4`,`title5`,`title6`,`img1`,`img2`,`img3`,`img4`,`img5`
)VALUES("1","01.jpg","草莓童话","圣诞节遇上草莓季，雪白的 cream cheese 包裹粉色的草莓奶油，坚果香浓郁的开心果酱与新鲜的红颜草莓果肉，完美的诠释了圣诞的色彩，美味交叠在口中绽放。圣诞童话，你の圣诞礼物，请查收","298","1.0磅","2.0磅","3.0磅","5.0磅","01.jpg","11.jpg","12.jpg","13.jpg","10.jpg"),
("2","02.jpg","520数字蛋糕","让数字告白蛋糕替你说 “ 我爱你！”","297","标准规格","","","","02.jpg","15.jpg","12.jpg","13.jpg","16.jpg"),
("3","03.jpg","100数字蛋糕","宝宝百天蛋糕 | 满分蛋糕","297","标准规格","","","","03.jpg","18.jpg","12.jpg","13.jpg","19.jpg"),
("4","04.jpg","blue蓝·童心未泯","岁月永远年轻，我们慢慢老去，你会发现，童心未泯是一件值得骄傲的事情。琐碎的生活总会带来很多糟心的事情，但是只要我们保持一颗童心，不忘初心，就能看到生活的美好","298","1.0磅","2.0磅","3.0磅","5.0磅","04.jpg","21.jpg","12.jpg","13.jpg","22.jpg"),
("5","23.jpg","pink粉·童心未泯","岁月永远年轻，我们慢慢老去，你会发现，童心未泯是一件值得骄傲的事情。琐碎的生活总会带来很多糟心的事情，但是只要我们保持一颗童心，不忘初心，就能看到生活的美好。","298","1.0磅","2.0磅","3.0磅","5.0磅","23.jpg","23.jpg","12.jpg","13.jpg","24.jpg"),
("6","25.jpg","美少女 | 香蕉巧克力慕斯","法国香蕉果茸马与法芙娜牛奶巧克力完美配比,俏皮的玩偶点缀可爱的马卡龙配色， 入口的那一秒变身美少女。","298","1.0磅","2.0磅","3.0磅","5.0磅","25.jpg","26.jpg","12.jpg","13.jpg","27.jpg"),
("7","06.jpg","芒果淡奶","明黄色是春夏开启的甜蜜信号 热情馥郁の芒果肉透亮而香甜 与特调乳脂淡奶油极致融合后 淡甜细腻在明媚季节温暖上市","268","1.0磅","2.0磅","3.0磅","5.0磅","06.jpg","28.jpg","12.jpg","13.jpg","29.jpg"),
("8","08.jpg","爱情の味道","玫瑰花酿与百利甜酒浪漫碰撞， 饱满果浆似恋爱般酸甜而温婉， 我把对你的爱藏在了这蛋糕里 ， 这一口，你尝到是爱情の味道。","298","1.0磅","2.0磅","3.0磅","5.0磅","08.jpg","55.jpg","12.jpg","13.jpg","56.jpg"),
("9","39.jpg","芒果千层","Q软的可丽饼融合细腻的淡奶油 坠入新鲜的澳芒透亮奔放的香","198","6寸","8寸","10寸","14寸","39.jpg","64.jpg","12.jpg","13.jpg","65.jpg"),
("10","41.jpg","草莓千层","Q软的可丽饼融合细腻的淡奶油 遇上酸甜适度皮薄汁多的红颜草莓","198","6寸","8寸","10寸","14寸","41.jpg","69.jpg","12.jpg","13.jpg","70.jpg"),
("11","90.jpg","原味 · 北海道の轻芝士","传说中最柔软的蛋糕，就像爱情温软而绵密。原味：顶级乳酪遇上北海道原生态尊贵牛乳","198","6寸","8寸","10寸","14寸","90.jpg","91.jpg","12.jpg","13.jpg","92.jpg"),
("12","93.jpg","榴莲芝士","一袭素雅净白里等待着你的是怎样难以抵挡的诱惑—浓郁的芝士味混合着迷人的榴莲香，口腔里还有依稀回荡的白兰地，仿佛踏上繁华热闹的异域之旅...","298","1.0磅","2.0磅","3.0磅","5.0磅","93.jpg","94.jpg","12.jpg","13.jpg","95.jpg"),
("13","85.jpg","奶油小贝BOX下午茶（整盒芒果）","This Box ，一口治愈假期综合症。","199","1.0磅","2.0磅","3.0磅","5.0磅","85.jpg","96.jpg","12.jpg","13.jpg","97.jpg"),
("14","86.jpg","Mini切片组合（白桃 | 蓝莓 | 金牌 | 百利甜 | 芒慕 | 覆盆子）","分享有多重要，蛋糕就有多美味。每份约200克","266","1.0磅","2.0磅","3.0磅","5.0磅","86.jpg","98.jpg","12.jpg","13.jpg","99.jpg"),
("15","100.jpg","new-奶油小贝BOX下午茶（三拼）","This Box ，一口治愈假期综合症","199","1.0磅","2.0磅","3.0磅","5.0磅","100.jpg","101.jpg","12.jpg","13.jpg","102.jpg"),
("16","88.jpg","芒果酸奶双拼","鲜奶包裹着的浓郁芒果肉透亮而香甜，搭配酸奶慕斯淡淡的奶香清新的口感，正是夏天的味道。","298","1.0磅","2.0磅","3.0磅","5.0磅","88.jpg","103.jpg","12.jpg","13.jpg","104.jpg"),
("17","105.jpg","朗姆芝士","奶油中淡淡的朗姆酒香，微微的苦涩，混合蛋糕坯中香橙的清香，夹心中奶酪天然的奶香和自然的酸味…","268","1.0磅","2.0磅","3.0磅","5.0磅","106.jpg","105.jpg","12.jpg","13.jpg","107.jpg");

-- 获取新品上市数据
DROP TABLE IF EXISTS `xinpin_detail`;
CREATE TABLE `xinpin_detail`(
    `id` int(11) PRIMARY KEY,
    `img` varchar(255) NOT NULL,
    `title` varchar(255) NOT NULL,
    `title1` varchar(255) NOT NULL,
    `title2` varchar(255) NOT NULL,
    `price` decimal(10,2) NOT NULL,
    `btn` varchar(255) NOT NULL,
    `btn1` varchar(255) NOT NULL
)ENGINE=InnoDB DEFAULT CHARSET=utf8;
INSERT INTO `xinpin_detail` (`id`,`img`,`title`,`title1`,`title2`,`price`,`btn`,`btn1`)VALUES
    ("1","06.jpg","芒果淡奶","口味：芒果口味","明黄色是春夏开启的甜蜜信号 热情馥郁の芒果肉透亮而香甜 与特调乳脂淡奶油极致融合后 淡甜细腻在明媚季节温暖上市","168","查看详情","加入购物车"),
    ("2","08.jpg","爱情の味道","口味：玫瑰／浆果","玫瑰花酿与百利甜酒浪漫碰撞， 饱满果浆似恋爱般酸甜而温婉， 我把对你的爱藏在了这蛋糕里 ， 这一口，你尝到是爱情の味道。","198","查看详情","加入购物车"),
    ("3","39.jpg","芒果千层","口味：芒果口味","Q软的可丽饼融合细腻的淡奶油 坠入新鲜的澳芒透亮奔放的香","198","查看详情","加入购物车"),
    ("4","41.jpg","草莓千层","口味：Q软的可丽饼融合细腻的淡奶油 遇上酸甜适度皮薄汁多的红颜草莓","Q软的可丽饼融合细腻的淡奶油 遇上酸甜适度皮薄汁多的红颜草莓","198","查看详情","加入购物车"),
    ("5","108.jpg","榴莲酸奶双拼","口味：酸奶拼榴莲","榴莲凭着它那独特的香味，滑似奶膏的果肉，搭配酸奶慕斯淡淡的奶香清新的口感，满满的幸福感。","298","查看详情","加入购物车"),
    ("6","109.jpg","网红数字蛋糕（商品价格为单个数字价格）","口味：奶油味","永远18岁","99","查看详情","加入购物车"),
    ("7","110.jpg","酸奶慕斯","口味：酸奶味","Marguerite是十六世纪挪威的一位公主。每一个女孩都渴望像玛格丽特那样骄傲、满意、喜悦，要她们的人生充满自信。","298","查看详情","加入购物车"),
    ("8","111.jpg","香浓起司巧克力","口味:巧克力起司","分享有多重要，蛋糕就有多美味。","168","查看详情","加入购物车"),
    ("9","87.jpg","new-奶油小贝BOX下午茶（三拼）","口味：草莓、抹茶、芒果（一套21小个，三种口味各七个）","This Box ，一口治愈假期综合症。","199","查看详情","加入购物车"),
    ("10","112.jpg","水果淡奶","口味：水果鲜奶","新鲜丰富的水果夹心，清香的酸甜味挑逗着味蕾 融入百香果茸的奶油层层叠加绵软的戚风蛋糕胚 蛋糕的甜腻消失得无影无踪","198","查看详情","加入购物车"),
    ("11","113.jpg","办公室下午茶（20小份）","口味：抹茶、覆盆子、提拉米苏、芒果、芝士","抹茶4份 芝士4份 覆盆子4份 芒果4份 巧克力4份 共20份 适合8-12人 配12个勺子","199","查看详情","加入购物车"),
    ("12","114.jpg","巧克力切片组合（起司 | 香蕉 | 比利时）","口味：巧克力（起司 | 香蕉 | 比利时）","使用法国进口可可百利巧克力制作醇香丝滑 每份约200克","114","查看详情","加入购物车");

-- 获取新品上市详情数据
DROP TABLE IF EXISTS `xinpin_xiangqing`;
CREATE TABLE `xinpin_xiangqing`(
    `id` int(11) PRIMARY KEY,
    `img` varchar(255) NOT NULL,
    `title` varchar(255) NOT NULL,
    `title1` varchar(255) NOT NULL,
    `price` decimal(10,2) NOT NULL,
    `title3` varchar(255) NOT NULL,
    `title4` varchar(255) NOT NULL,
    `title5` varchar(255) NOT NULL,
    `title6` varchar(255) NOT NULL,
    `img1` varchar(255) NOT NULL,
    `img2` varchar(255) NOT NULL,
    `img3` varchar(255) NOT NULL,
    `img4` varchar(255) NOT NULL,
    `img5` varchar(255) NOT NULL
)ENGINE=InnoDB DEFAULT CHARSET=utf8;
INSERT INTO `xinpin_xiangqing` (`id`,`img`,`title`,`title1`,`price`,
    `title3`, `title4`,`title5`,`title6`,`img1`,`img2`,`img3`,`img4`,`img5`
)VALUES("1","06.jpg","芒果淡奶","明黄色是春夏开启的甜蜜信号 热情馥郁の芒果肉透亮而香甜 与特调乳脂淡奶油极致融合后 淡甜细腻在明媚季节温暖上市","268","1.0磅","2.0磅","3.0磅","5.0磅","06.jpg","28.jpg","12.jpg","13.jpg","29.jpg"),
("2","08.jpg","爱情の味道","玫瑰花酿与百利甜酒浪漫碰撞， 饱满果浆似恋爱般酸甜而温婉， 我把对你的爱藏在了这蛋糕里 ， 这一口，你尝到是爱情の味道。","298","1.0磅","2.0磅","3.0磅","5.0磅","08.jpg","55.jpg","12.jpg","13.jpg","56.jpg"),
("3","39.jpg","芒果千层","Q软的可丽饼融合细腻的淡奶油 坠入新鲜的澳芒透亮奔放的香","198","6寸","8寸","10寸","14寸","39.jpg","64.jpg","12.jpg","13.jpg","65.jpg"),
("4","41.jpg","草莓千层","Q软的可丽饼融合细腻的淡奶油 遇上酸甜适度皮薄汁多的红颜草莓","198","6寸","8寸","10寸","14寸","41.jpg","69.jpg","12.jpg","13.jpg","70.jpg"),
("5","108.jpg","榴莲酸奶双拼","榴莲凭着它那独特的香味，滑似奶膏的果肉，搭配酸奶慕斯淡淡的奶香清新的口感，满满的幸福感。","298","1.0磅","2.0磅","3.0磅","5.0磅","108.jpg","115.jpg","12.jpg","13.jpg","116.jpg"),
("6","109.jpg","网红数字蛋糕","网红数字蛋糕（商品价格为单个数字价格）","99","标准规格","","","","109.jpg","109.jpg","12.jpg","13.jpg","117.jpg"),
("7","110.jpg","酸奶慕斯","Marguerite是十六世纪挪威的一位公主。每一个女孩都渴望像玛格丽特那样骄傲、满意、喜悦，要她们的人生充满自信。","298","1.0磅","2.0磅","3.0磅","5.0磅","110.jpg","118.jpg","12.jpg","13.jpg","119.jpg"),
("8","111.jpg","香浓起司巧克力","爱的味道","168","6寸","8寸","10寸","14寸","111.jpg","120.jpg","12.jpg","13.jpg","121.jpg"),
("9","100.jpg","new-奶油小贝BOX下午茶（三拼）","This Box ，一口治愈假期综合症","199","1.0磅","2.0磅","3.0磅","5.0磅","100.jpg","101.jpg","12.jpg","13.jpg","102.jpg"),
("10","112.jpg","水果淡奶","新鲜丰富的水果夹心，清香的酸甜味挑逗着味蕾 融入百香果茸的奶油层层叠加绵软的戚风蛋糕胚 蛋糕的甜腻消失得无影无踪","298","1.0磅","2.0磅","3.0磅","5.0磅","112.jpg","122.jpg","12.jpg","13.jpg","123.jpg"),
("11","113.jpg","办公室下午茶（20小份）","抹茶4份 芝士4份 覆盆子4份 芒果4份 巧克力4份 共20份 适合8-12人 配12个勺子","199","限时特惠","","","","113.jpg","113.jpg","12.jpg","13.jpg","124.jpg"),
("12","114.jpg","巧克力切片组合（起司 | 香蕉 | 比利时）","使用法国进口可可百利巧克力制作醇香丝滑 每份约200克","114","标准规格","","","","114.jpg","125.jpg","12.jpg","13.jpg","126.jpg");

-- 购物车
DROP TABLE IF EXISTS `shop_cart`;
CREATE TABLE `shop_cart`(
    `id` int(11) PRIMARY KEY AUTO_INCREMENT,
    `lid` INT,
    `limg` VARCHAR(255),
    `lname` VARCHAR(255),
    `price` DECIMAL(10,2),
    `count` INT,
    `uid` INT
);
